def sityvebis_datvla():
    წინადადება = input("შეიყვანე წინადადება: ")
    
    სიტყვები = წინადადება.split()
    
    რაოდენობა = 0
    
    for სიტყვა in სიტყვები:
        if len(სიტყვა) > 4:
            რაოდენობა = რაოდენობა + 1
            
    print("4-ზე მეტი სიმბოლოს მქონე სიტყვების რაოდენობაა:", რაოდენობა)

sityvebis_datvla()

# 4) შექმენით ფუნქცია. მომხმარებელს შემოატანინეთ წინადადების სტრინგი. 
# დათვალე, რამდენი სიტყვის სიგრძე არის 4-ზე მეტი. დაპრინტე ასეთი სიტყვების რაოდენობა. 
# დაწერეთ ეს დავალება ორნაირად
#  - split() ფუნქციით და split() ფუნქციის გარეშე.