def gamoare_dublikatebi():
    ricxvebi = [1, 2, 2, 3, 3, 4, 5, 6, 5, 7, 1, 8]
    
    ახალი_სია = []
    
    for რიცხვი in ricxvebi:
        if რიცხვი not in ახალი_სია:
            ახალი_სია.append(რიცხვი)
    
    print("სია დუბლიკატების გარეშე:", ახალი_სია)

gamoare_dublikatebi()

# 5) შექმენით ფუნქცია. შექმენი რიცხვებით სავსე სია, სადაც დუბლიკატები -
#  ანუ გამეორებული ელემენტები აღარ იქნება, მაგრამ ელემენტების თანმიმდევრობა შენარჩუნდეს. 
# მაგალითად თუ მოცემული გვქონდა სია: [1, 2, 2, 3, 3, 4, 5, 6, 5], უნდა დავპრინტოთ [1, 2, 3, 4, 5, 6].
#  გამოიყენე for ციკლი და if. გამოიძახეთ ფუნქცია.