def ყველაზე_გრძელი_სიტყვა():
    წინადადება = input("შეიყვანე წინადადება: ")
    
    სიტყვები = წინადადება.split()
    
    if not სიტყვები:
        print("წინადადება ცარიელია")
        return
    
    i = 0
    ყველაზე_გრძელი = სიტყვები[0]
    
    while i < len(სიტყვები):
        თუ_ეს_უფრო_გრძელია = სიტყვები[i]
        if len(თუ_ეს_უფრო_გრძელია) > len(ყველაზე_გრძელი):
            ყველაზე_გრძელი = თუ_ეს_უფრო_გრძელია
        i = i + 1
    
    print("ყველაზე გრძელი სიტყვაა:", ყველაზე_გრძელი)

ყველაზე_გრძელი_სიტყვა()

# 6) შექმენით ფუნქცია. მომხმარებელს შემოატანინე წინადადება. იპოვე და დაბეჭდე ყველაზე გრძელი სიტყვა ამ წინადადებაში. 
# გამოიყენეთ while ციკლი. გამოიძახეთ ფუნქცია.